// not a huge fan of these symbols, might need some work
export const letterToSpecialChars: Map<string, string[]> = new Map([
  ["A", ["@", "4", "▲", "∆", "α", "Å", "λ"]],
  ["B", ["8", "3", "ß", "Þ", "β"]],
  ["C", ["(", "©", "¢", "<", "Ƈ", "Ç"]],
  ["D", ["Ð", "∂", "Ɗ"]],
  ["E", ["3", "€", "£", "Σ", "Ǝ"]],
  ["F", ["ƒ", "ϝ"]],
  ["G", ["6", "9", "&", "ɢ"]],
  ["H", ["#", "ħ", "ɦ", ":"]],
  ["I", ["!", "1", "|", "l", "ɩ", ":"]],
  ["J", ["_|", "¿", "ʝ"]],
  ["K", ["κ", "к"]],
  ["L", ["1", "£", "∟"]],
  ["M", ["/", "^", "ɱ", "%,", "*"]],
  ["N", ["ɲ", "^", "*", "#"]],
  ["O", ["0", "°", "ø", "@", "."]],
  ["P", ["|*", "|>", "ρ", "þ", "ϱ"]],
  ["Q", ["0,", "9", "(,)", "ʠ"]],
  ["R", ["®", "ʀ", "-"]],
  ["S", ["$", "5", "§", "ś", "š"]],
  ["T", ["7", "+", "†", "‡"]],
  ["U", ["µ", "ʉ"]],
  ["V", ["ʋ", "@", "^"]],
  ["W", ["v", "ɯ"]],
  ["X", ["×", "ẋ", "χ"]],
  ["Y", ["`", "¥", "ɏ"]],
  ["Z", ["2", "7", "≥", "ƶ"]],
]);

import typingModelUrl from "@/assets/models/typing.glb?url";
export const TestSceneResources: string[] = [typingModelUrl];
